src/exercises/sorting/sorting.org
#+TITLE: "Sort of" Exercise

* Description
Complete the following exercises and submit your answer to KATIE as a single file (archive).

You can complete this exercise either manually (paper and pencil) or by modifying the implementations of the algorithms provided in the textbook and pythonds3 to print status after each iteration.

1. Sort list using /Insertion/ sorting
2. Sort list using /Selection/ sorting
3. Sort list using /MergeSort/
4. Sort list using /QuickSort/
5. Sort list using /HeapSort/ algorithm

The provided output file contains the results of using various algorithms to sort list =[594, 850, 281, 952, 129, 348, 264, 972, 598, 758]=.

The value is marked **red** while under review and **blue** once it's settled in its final position.

* Algorithms

** Insertion Sort
| 15 | 16 | 73 | 65 | 38 | 10 | 22 | 79 | 87 | 64 |
| 15 | 16 | 73 | 65 | 38 | 10 | 22 | 79 | 87 | 64 |
| 15 | 16 | 73 | 65 | 38 | 10 | 22 | 79 | 87 | 64 |
| 15 | 16 | 65 | 73 | 38 | 10 | 22 | 79 | 87 | 64 |
| 15 | 16 | 38 | 65 | 73 | 10 | 22 | 79 | 87 | 64 |
| 10 | 15 | 16 | 38 | 65 | 73 | 22 | 79 | 87 | 64 |
| 10 | 15 | 16 | 22 | 38 | 65 | 73 | 79 | 87 | 64 |
| 10 | 15 | 16 | 22 | 38 | 65 | 73 | 79 | 87 | 64 |
| 10 | 15 | 16 | 22 | 38 | 65 | 73 | 79 | 87 | 64 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 79 | 87 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 79 | 87 |

** Selection Sort
| 15 | 16 | 73 | 65 | 38 | 10 | 22 | 79 | 87 | 64 |
| 10 | 16 | 73 | 65 | 38 | 15 | 22 | 79 | 87 | 64 |
| 10 | 15 | 73 | 65 | 38 | 16 | 22 | 79 | 87 | 64 |
| 10 | 15 | 16 | 65 | 38 | 73 | 22 | 79 | 87 | 64 |
| 10 | 15 | 16 | 22 | 38 | 73 | 65 | 79 | 87 | 64 |
| 10 | 15 | 16 | 22 | 38 | 73 | 65 | 79 | 87 | 64 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 79 | 87 | 73 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 79 | 87 | 73 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 87 | 79 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 79 | 87 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 79 | 87 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 79 | 87 |

** Merge Sort
=Splitting [15, 16, 73, 65, 38, 10, 22, 79, 87, 64]=

=Splitting [15, 16, 73, 65, 38]=

=Splitting [15, 16]=

=Splitting [15]=

=Merging [15]=

=Splitting [16]=

=Merging [16]=

=Merging [15, 16]=

=Splitting [73, 65, 38]=

=Splitting [73]=

=Merging [73]=

=Splitting [65, 38]=

=Splitting [65]=

=Merging [65]=

=Splitting [38]=

=Merging [38]=

=Merging [38, 65]=

=Merging [38, 65, 73]=

=Merging [15, 16, 38, 65, 73]=

=Splitting [10, 22, 79, 87, 64]=

=Splitting [10, 22]=

=Splitting [10]=

=Merging [10]=

=Splitting [22]=

=Merging [22]=

=Merging [10, 22]=

=Splitting [79, 87, 64]=

=Splitting [79]=

=Merging [79]=

=Splitting [87, 64]=

=Splitting [87]=

=Merging [87]=

=Splitting [64]=

=Merging [64]=

=Merging [64, 87]=

=Merging [64, 79, 87]=

=Merging [10, 22, 64, 79, 87]=

=Merging [10, 15, 16, 22, 38, 64, 65, 73, 79, 87]=

=[10, 15, 16, 22, 38, 64, 65, 73, 79, 87]=

** Quick Sort
| 15 | 16 | 73 | 65 | 38 | 10 | 22 | 79 | 87 | 64 |
| 10 | 15 | 73 | 65 | 38 | 16 | 22 | 79 | 87 | 64 |
| 10 | 15 | 64 | 65 | 38 | 16 | 22 | 73 | 87 | 79 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 87 | 79 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 87 | 79 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 87 | 79 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 79 | 87 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 79 | 87 |

** Heap Sort
| 15 | 16 | 73 | 65 | 38 | 10 | 22 | 79 | 87 | 64 |
| 15 | 16 | 73 | 65 | 64 | 10 | 22 | 79 | 87 | 38 |
| 15 | 16 | 73 | 87 | 64 | 10 | 22 | 79 | 65 | 38 |
| 15 | 16 | 73 | 87 | 64 | 10 | 22 | 79 | 65 | 38 |
| 15 | 87 | 73 | 79 | 64 | 10 | 22 | 16 | 65 | 38 |
| 87 | 79 | 73 | 65 | 64 | 10 | 22 | 16 | 15 | 38 |
| 10 | 15 | 16 | 22 | 38 | 64 | 65 | 73 | 79 | 87 |
