src/exercises/sorting/sorting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-27 Sat 16:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&ldquo;Sort of&rdquo; Exercise</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">&ldquo;Sort of&rdquo; Exercise</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org122214c">1. Description</a></li>
<li><a href="#org5fd392e">2. Algorithms</a>
<ul>
<li><a href="#org394677e">2.1. Insertion Sort</a></li>
<li><a href="#orgea845c7">2.2. Selection Sort</a></li>
<li><a href="#org3588322">2.3. Merge Sort</a></li>
<li><a href="#org825f78b">2.4. Quick Sort</a></li>
<li><a href="#org7fdf6e2">2.5. Heap Sort</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org122214c" class="outline-2">
<h2 id="org122214c"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
Complete the following exercises and submit your answer to KATIE as a single file (archive).
</p>

<p>
You can complete this exercise either manually (paper and pencil) or by modifying the implementations of the algorithms provided in the textbook and pythonds3 to print status after each iteration.
</p>

<ol class="org-ol">
<li>Sort list using <i>Insertion</i> sorting</li>
<li>Sort list using <i>Selection</i> sorting</li>
<li>Sort list using <i>MergeSort</i></li>
<li>Sort list using <i>QuickSort</i></li>
<li>Sort list using <i>HeapSort</i> algorithm</li>
</ol>

<p>
The provided output file contains the results of using various algorithms to sort list <code>[594, 850, 281, 952, 129, 348, 264, 972, 598, 758]</code>.
</p>

<p>
The value is marked <b><b>red</b></b> while under review and <b><b>blue</b></b> once it&rsquo;s settled in its final position.
</p>
</div>
</div>

<div id="outline-container-org5fd392e" class="outline-2">
<h2 id="org5fd392e"><span class="section-number-2">2</span> Algorithms</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org394677e" class="outline-3">
<h3 id="org394677e"><span class="section-number-3">2.1</span> Insertion Sort</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">38</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">38</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">38</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgea845c7" class="outline-3">
<h3 id="orgea845c7"><span class="section-number-3">2.2</span> Selection Sort</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">15</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">73</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">73</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">73</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">87</td>
<td class="org-right">79</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org3588322" class="outline-3">
<h3 id="org3588322"><span class="section-number-3">2.3</span> Merge Sort</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>Splitting [15, 16, 73, 65, 38, 10, 22, 79, 87, 64]</code>
</p>

<p>
<code>Splitting [15, 16, 73, 65, 38]</code>
</p>

<p>
<code>Splitting [15, 16]</code>
</p>

<p>
<code>Splitting [15]</code>
</p>

<p>
<code>Merging [15]</code>
</p>

<p>
<code>Splitting [16]</code>
</p>

<p>
<code>Merging [16]</code>
</p>

<p>
<code>Merging [15, 16]</code>
</p>

<p>
<code>Splitting [73, 65, 38]</code>
</p>

<p>
<code>Splitting [73]</code>
</p>

<p>
<code>Merging [73]</code>
</p>

<p>
<code>Splitting [65, 38]</code>
</p>

<p>
<code>Splitting [65]</code>
</p>

<p>
<code>Merging [65]</code>
</p>

<p>
<code>Splitting [38]</code>
</p>

<p>
<code>Merging [38]</code>
</p>

<p>
<code>Merging [38, 65]</code>
</p>

<p>
<code>Merging [38, 65, 73]</code>
</p>

<p>
<code>Merging [15, 16, 38, 65, 73]</code>
</p>

<p>
<code>Splitting [10, 22, 79, 87, 64]</code>
</p>

<p>
<code>Splitting [10, 22]</code>
</p>

<p>
<code>Splitting [10]</code>
</p>

<p>
<code>Merging [10]</code>
</p>

<p>
<code>Splitting [22]</code>
</p>

<p>
<code>Merging [22]</code>
</p>

<p>
<code>Merging [10, 22]</code>
</p>

<p>
<code>Splitting [79, 87, 64]</code>
</p>

<p>
<code>Splitting [79]</code>
</p>

<p>
<code>Merging [79]</code>
</p>

<p>
<code>Splitting [87, 64]</code>
</p>

<p>
<code>Splitting [87]</code>
</p>

<p>
<code>Merging [87]</code>
</p>

<p>
<code>Splitting [64]</code>
</p>

<p>
<code>Merging [64]</code>
</p>

<p>
<code>Merging [64, 87]</code>
</p>

<p>
<code>Merging [64, 79, 87]</code>
</p>

<p>
<code>Merging [10, 22, 64, 79, 87]</code>
</p>

<p>
<code>Merging [10, 15, 16, 22, 38, 64, 65, 73, 79, 87]</code>
</p>

<p>
<code>[10, 15, 16, 22, 38, 64, 65, 73, 79, 87]</code>
</p>
</div>
</div>

<div id="outline-container-org825f78b" class="outline-3">
<h3 id="org825f78b"><span class="section-number-3">2.4</span> Quick Sort</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">73</td>
<td class="org-right">87</td>
<td class="org-right">79</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">87</td>
<td class="org-right">79</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">87</td>
<td class="org-right">79</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">87</td>
<td class="org-right">79</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7fdf6e2" class="outline-3">
<h3 id="org7fdf6e2"><span class="section-number-3">2.5</span> Heap Sort</h3>
<div class="outline-text-3" id="text-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">64</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
<td class="org-right">38</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">73</td>
<td class="org-right">87</td>
<td class="org-right">64</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">79</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-right">87</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">64</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">16</td>
<td class="org-right">65</td>
<td class="org-right">38</td>
</tr>

<tr>
<td class="org-right">87</td>
<td class="org-right">79</td>
<td class="org-right">73</td>
<td class="org-right">65</td>
<td class="org-right">64</td>
<td class="org-right">10</td>
<td class="org-right">22</td>
<td class="org-right">16</td>
<td class="org-right">15</td>
<td class="org-right">38</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">15</td>
<td class="org-right">16</td>
<td class="org-right">22</td>
<td class="org-right">38</td>
<td class="org-right">64</td>
<td class="org-right">65</td>
<td class="org-right">73</td>
<td class="org-right">79</td>
<td class="org-right">87</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-03-27 Sat 16:55</p>
</div>
</body>
</html>
